C2CRIBuildDir/projects/C2C-RI/src/RIGUI/CustomTestSuites/TMDDV303aExtensionToBlankTestSuite/InfoLayer/Data/TCS-93-dlIntersectionSignalTimingPatternInventorySubscription-EC-InValid-4.data

 
#<!--   
#       Title:  TCS-93-dlIntersectionSignalTimingPatternInventorySubscription-EC-InValid-4
#       Description:  This test case is used to verify the SUTs support of the dlIntersectionSignalTimingPatternInventorySubscription dialog as an EC using the variable values specified by the Test Plan.   This test case supports verification of requirements related to user need 2.3.5.10.8 [Need to Share Controller Timing Patterns]. This Test Case tests for a InValid (4) response result.
#       Related Procedure:  TPS-93-dlIntersectionSignalTimingPatternInventorySubscription-EC
#       Version/Date: 2013/09/25 10:51:28
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
CheckOutcomePassed = true

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
VerificationSpec = #VALUESPEC#Values#VALUESPEC#

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable identifies the Application Layer Standard that will be used for this test.
ApplicationLayerStandard = NTCIP2306v01

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Publication Message to be sent to the SUT.
PublicationMessage = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://www.tmdd.org/303/messages"><soapenv:Header/><soapenv:Body><c2c:c2cMessagePublication xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionFrequency>7</subscriptionFrequency><subscriptionCount>7</subscriptionCount></c2c:c2cMessagePublication><mes:intersectionSignalTimingPatternInventoryMsg><intersection-signal-timing-pattern-inventory-item><restrictions><organization-information-forwarding-restrictions>not to public</organization-information-forwarding-restrictions></restrictions><organization-information><organization-id>transcore.com</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>tcore_test</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>33964380</latitude><longitude>-84217945</longitude><horizontalDatum>3</horizontalDatum><height><altitude><ft>3</ft></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></organization-information><device-id>string</device-id><timing-pattern-id>string</timing-pattern-id><timing-pattern-name>string</timing-pattern-name><cycle-length>6</cycle-length><offset-time>6</offset-time><phase-tp-list><phases><phase-identifier>6</phase-identifier><coordinated-phase>1</coordinated-phase><split-mode>maximumVehicleRecall</split-mode><phase-split>6</phase-split><maximum-green-duration>7</maximum-green-duration><minimum-green-duration>7</minimum-green-duration><vehicle-clearance-duration>7</vehicle-clearance-duration><vehicle-red-duration>7</vehicle-red-duration><minimum-walk-duration>7</minimum-walk-duration><pedestrian-clearance-duration>7</pedestrian-clearance-duration><steady-dont-walk-duration>7</steady-dont-walk-duration></phases></phase-tp-list><sequence-information><sequence-information><ring-identifier>string</ring-identifier><sequence-data><phase-identifier>6</phase-identifier></sequence-data></sequence-information></sequence-information><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></intersection-signal-timing-pattern-inventory-item><mes:intersectionSignalTimingPatternInventoryMsg></soapenv:Body></soapenv:Envelope>

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates number of publication message transmissions expected as part of this test.
PublicationCount = 0

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a Publication  error response is expected from the SUT.
PublicationErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of Publication response error that is expected from the SUT.
PublicationErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This flag defines whether the Test Application will test for Authentication
AuthenticationCheck = False

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected user name.
Username = defaultUser

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected password.
Password = defaultPassword

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Organization Identifier.
OrganizationID = defaultOrgID

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether the SUT has the privilege to access the information requested.
AllowAccess = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a subscription request error is expected from the SUT.
SubscriptionErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of subscription request error that is expected from the SUT.
SubscriptionErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Subscription Response Message to be sent to the SUT.
SubscriptionResponseMessage = #MESSAGESPEC#SubResponseMessage#MESSAGESPEC#


#GROUP NAME = Values

